let arrPrilIskl = [],
    arrKratkotPrich = [],
    arrSuffOnnEnn = [],
    arrSushN = [],
    arrPrichsPrist = [],
    arrPrichSov = [],
    arrPrichOvaEva = [],
    arrPrichZavis = [],
    arrPrichNesov = [],
    arrPrichIskl = [],
    arrPrichKr = [],
    arrPrilVetr = [],
    arrPrilNul = [],
    arrPrilAn = [],
    arrPrilJan = [],
    arrPrilIn = [];

const prilIskl = ('стекля...ый, оловя...ый, деревя...ый');
arrPrilIskl = prilIskl.split(',').map(x => x.trim());

const kratkotPrich = ('взволнова...ы (беспокойны), изыска...ы (утончённые), надума...ы (сомнительны), воспита...ы (культурны), рассея...а (невнимательна), избалова...а (капризна), образова...ы (умны), сосредоточе...а (внимательна)');
arrKratkotPrich = kratkotPrich.split(',').map(x => x.trim());

const suffOnnEnn = ('авиацио...ый, аппликацио...ый, бездотацио...ый, вегетацио...ый, гравитацио...ый, дегустацио...ый, демобилизацио...ый, диверсио...ый, диссертацио...ый, дистанцио...ый, дотацио...ый, имитацио...ый, инкубацио...ый, информацио...ый, ирригацио...ый, канализацио...ый, комиссио...ый, композицио...ое, концессио...ый, координацио...ый, ликвидацио...ый, лицензио...ый, миграцио...ый, мультипликацио...ый, мутацио...ый, навигацио...ый, обсервацио...ая, операцио...ый, организацио...ый, пансио...ый, пенсио...ый, порцио...ый, провокацио...ый, пунктуацио...ые, радиацио...ая, реакцио...ая, ревизио...ый, революцио...ый, редакцио...ый, рекреацио...ый, реставрацио...ый, сенсацио...ая, сессио...ый, сигнализацио...ая, станцио...ый, телевизио...ый, трансмиссио...ый, ферментацио...ый, фортифицирова...ый, экзаменацио...ый, экскурсио...ый, эмульсио...ый, бедстве...ый, безбоязне...ый, безветре...ый, безветре...ый, бездействе...ый, безжизне...ый, безнравстве...ый, безукоризне...ый, береме...ая, бессмысле...ый, бесчисле...ый, бесчувстве...ый, благодарстве...ый, блаже...ы, блаже...ый, богобоязне...ый, божестве...ый, болезне...ый, буйстве...ый, внутре...ий, восторже...ый, вдохнове...ый, величестве...ый, вельможестве...ый, государстве...ый, девстве...ый, действе...ый, дерзнове...ый, дружестве...ый, единстве...ая, естестве...ый, женстве...ый, жертве...ый, жизне...ый, искусстве...ый, кожеве...ый, коре...ой, косве...ый, легкомысле...ый, лекарстве...ый, конюше...ый, медле...ы, медле...ый, мертве...ый, множестве...ые, могуществе...ый, молитве...ый, мужестве...ый, мысле...ый, насильстве...ый, наследстве...ое, неискуше...ый, немедле...ый, немногочисле...ые, необыкнове...а, необыкнове...ый, непосредстве...ое, неприкоснове...ый, непринужде...ый, неприязне...ый, несомне...ый, неумере...ое, неумышле...ое, обществе...ой, огне...ый, обыкнове...ый, осмысле...ый, осовремене...ый, ответстве...ый, отечестве...ые, открове...ый, пожизне...ая, письме...ый, посредстве...ый, потомстве...ый, почте...ейший, почте...ый, предреформе...ые, правительстве...ый, презре...а, презре...ый, прижизне...ый, присутстве...ый, производстве...ый, родстве...ые, сверхъестестве...ый, свойстве...ый, семействе...ый, собстве...ое, соломе...ая, соте...ая, страше...ый, существе...ый, таинстве...ый, торжестве...ый, умстве...ый, умышле...ый, утре...ий, форме...ый, хозяйстве...ый, художестве...ыми, царстве...ый, целомудре...ый, чувстве...ый, экстре...ый, явстве...ый');
arrSuffOnnEnn = suffOnnEnn.split(',').map(x => x.trim());

const sushN = ('анте...ый, балко...ое, око...ый, баклажа...ый, ба...ый, бараба...ый, безви...ый, бездо...ый, безыме...ый, безымя...ый, беспардо...ый, беспричи...ый, бессо...ый, бесцеремо...ый, бето...ый, благоскло...ый, бра...ый, бре...ый, бура...ый, бурья...ый, весе...ий, ви...ый, време...ой, време...ый, вое...ый, газо...ый, гарнизо...ый, глуби...ый, двугриве...ый, дива...ый, дли...ый, драгоце...а, драгоце...ый, дружи...ый, дря...ой, дюжи...ое, жема...ая, заблаговреме...ый, забубе...ый, зако...ы, зако...ый, име...ые, имени...ый, иностра...ый, иско...ый, искре...ий, исти...ый, казе...ый, каме...ые, карма...ое, карти...ая, карто...ыми, коло...ый, котлова...ый, лимо...ый, лу...ый, надме...а, надме...ый, мали...ый, ма...ая, маши...ое, мгнове...ый, миллио...ый, ми...ое, многосторо...ий, многото...ый, моното...ый, насте...ый, неблагоскло...ы, неви...ый, неизме...ый, непрекло...ый, нетле...ы, нетле...ый, неугомо...ый, низме...ый, обма...ый, обме...ый, общи...ый, овчи...ый, односторо...ий, одновреме...ый, око...ый, пе...ый, переме...ый, песе...ый, пови...ый, поиме...ый, покло...ый, полови...ый, полуде...ый, послеобеде...ый, послевое...ый, пше...ый, ра...ий, стари...ый, постепе...ый, посторо...ий, потого...ое, похоро...ый, преждевреме...ый, присте...ый, промышле...ый, реме...ой, рома...ый, рути...ый, сало...ый, сарафа...ый, сафья...ый, сезо...ый, семе...ой, се...ой, сме...ый, смета...ый, смире...ый, смороди...ая, совреме...ый, со...ый, спи...ой, стари...ый, сте...ые, сторо...яя, суко...ый, тле...ый, трехарши...ый, тума...а, тума...ый, це...ейший, це...ый, церемо...ы, церемо...ый, черво...ый, ячме...ый');
arrSushN = sushN.split(',').map(x => x.trim());

const prichsPrist = ('введе...ый, вдавле...ые, взбеше...ый, взлелея...ый, взреза...ый, взъероше...ый, увиде...ый, вкопа...ый, внесе...ый, возведе...ая, вымоче...ый, завеше...ый, завяза...ые, заглуше...ый, загроможде...ый, загрязне...ый, задума...ый, зажмуре...ый, закале...ый, заключе...ый, заколдова...ый, заколоче...ая, законче...ый, закопче...ый, закруче...ый, залече...ый, заложе...ый, замасле...ый, замедле...ый, замече...ых, заморе...ый, замороже...ый, изноше...ый, изображе...ых, изобрете...ый, изуче...ый, искаже...ый, искривле...ый, испещре...ый, испорче...ые, иссече...ыми, исступле...ый, наброше...ый, навея...ая, наезже...ая, назначе...ую, наклоне...ом, накрахмале...ое, намаза...ое, намасле...ый, напое...ый, наполне...ый, напряже...ым, напудре...ый, нарече...ый, нарумяне...ый, наруше...ый, наряже...ые, населе...ый, настоя...ый, настрое...ый, науче...ый, нахлобуче...ый, нахмуре...ый, начерче...ый, начине...ые, невысказа...ые, недоваре...ый, недоеде...ый, недострое...ый, ободра...ые, ободре...ый, обожже...ое, обойде...ый, одушевле...ый, ожесточе...ый, оживле...ый, озабоче...ым, озадаче...ый, озаре...ый, озлобле...ый, ознакомле...ый, оказа...ая, окая...ый, оклее...ый, окровавле...ый, округле...ый, окруже...ый, опале...ый, ополовине...ый, опошле...ый, опояса...ый, опроше...ые, опроще...ый опуше...ые, опьяне...ый, ороше...ыми, осене...ый, осия...ый, оскале...ыми, оскорбле...ым, оставле...ая, остриже...ые, осужде...ые, осчастливле...ый, отвлече...ый, отягче...ый, охлажде...ый, принужде...ая, приобрете...ый, припасе...ый, припудре...ый, прирожде...ый, прислоне...ые, приставле...ого, пристреле...ый, пристыже...ый, прицеле...ый, причисле...ый, пришибле...ый, прищуре...ый, пробужде...ый, проведе...ый, проглоче...ый, продавле...ый, произведе...ый, произнесе...ого, пройде...ый, прокопче...ыми, прорва...ый, прославле...ый, просмотре...ый, прохваче...ая, разброса...ые, развинче...ый, разгоряче...ый, раздраже...ый, размягче...ое, разнеже...ый, разреза...ый, разрозне...ый, разрумяне...ая, раскале...ое, распуще...ый, рассерже...ый, рассея...ый, расслабле...ым, расстрое...ое, растворе...ый, растопыре...ый, растрепа...ая, расчеса...ыми, расчище...ый, самонадея...ый, самоувере...ый, сваре...ый, свежепросоле...ые, сгорбле...ая, сдавле...ый, сдержа...ый, скова...ый, сколоче...ый, сконфуже...ый, скоше...ый, скреще...ыми, скрое...ый, скруче...ые, сложе...ый, сложноподчине...ое, слома...ая, смеша...ое, сморще...ый, смуще...ый, сожже...ый, собра...ый, сокраще...ых');
arrPrichsPrist = prichsPrist.split(',').map(x => x.trim());

const prichSov = ('броше...ый, внуше...ый, да...ый, купле...ый, лише...ый, новорожде...ый, обиже...ый, пленё...ый, реше...ый, рожде...ый');
arrPrichSov = prichSov.split(',').map(x => x.trim());

const prichOvaEva = ('авторизова...ый, адресова...ый, аккумулирова...ый, балова...ые, бракова...ый, бронирова...ый, ворова...ый, газирова...ая, гофрирова...ый, гранулирова...ые, дарова...ый, дегустирова...ый, дрессирова...ый, зомбирова...ый, идеализирова...ый, изолирова...ый, иллюстрирова...ый, имитирова...ый, информирова...ый, йодирова...ая, карамелизирова...ый, квалифицирова...ый, кодифицирова...ый, кондиционирова...ый, коррумпирова...ый, костюмирова...ый, кристаллизова...ый, купирова...ый, лакирова...ый, малева...ый, маринова...ый, маскирова...ый, меблирова...ые, мелова...ый, мелирова...ый, мотивирова...ый, мутирова...ые,  надёва...ый, ненадёва...ое, нумерова...ые, организова...ый, позиционирова...ый, пломбирова...ый, рафинирова...ый, регистрирова...ый, рекомендова...ый, ремонтирова...ый, реставрирова...ый, рисова...ый, рифмова...ый, согласова...ый, стилизова...ый, театрализова...ая, титулова...ый, тонирова...ый, тренирова...ый, фарширова...ые, ферментирова...ый, шинкова...ый, шипова...ый, шифрова...ый, штрафова...ый, централизова...ый, эмалирова...ый, эрудирова...ый');
arrPrichOvaEva = prichOvaEva.split(',').map(x => x.trim());

const prichZavis = ('давно кроше...ый, еще не коше...ое, еще не ноше...ый, жаре...ый в масле, копче...ый вчера, краше...ый кистью, ране...ый в голову, уже ноше...ый, беле...ый вчера, вяле...ый на солнце, груже...ый углём, золоче...ый краской, кваше...ая в миске, хорошо кипяче...ые, немного копче...ый, кормле...ый мамой, крепко крахмале...ый, креще...ый давно, давно не лече...ый, лома...ая бурей, меря...ый человеком, мече...ый полоской, мороже...ые продавцом, моче...ые в уксусе, моще...ая булыжником, паре...ый в печи, паха...ый трактором, пая...ый мастером, сильно перче...ый, искусно плете...ая, проще...ый нами, не пуга...ый никем, рва...ый псом, рубле...ый мелко, соле...ые из солонки, стира...ый давно, суше...ая на солнце, тёса...ый вручную, тисне...ый золотом, топле...ое в печи, туше...ые на сковороде, великолепно чище...ое, штукатуре...ый механически');
arrPrichZavis = prichZavis.split(',').map(x => x.trim());

const prichNesov = ('беле...ый, беше...ый, варе...ый, вяле...ый, грабле...ый, гране...ый, груже...ый, дёрга...ый, долбле...ый, домотка...ый, жаре...ый, золоче...ый, игра...ый, изумле...ая, кале...ый, калече...ый, кваше...ая, кипяче...ая, клейме...ый, клёпа...ый, колоче...ый, комка...ый, копа...ый, копче...ый, кормле...ый, краде...ое, крахмале...ый, краше...ыми, крепле...ый, креще...ый, кроше...ый, круче...ый, лече...ый, лома...ый, лоще...ый, меря...ый, мече...ый, меша...ый, молоче...ый, море...ый, мороже...ое, моче...ый, моще...ая, ...ебеле...ый, ...евяле...ый, ...егаше...ые, ...екоше...ый, ...екормле...ый, ...емаза...ое, ...есоле...ый, ...етка...ый, ...етопле...ый, ...ечеса...ый, ...ехоже...ый, ...ештопа...ый, ...оше...ый, пале...ый, паре...ый, паха...ый, пая...ый, перче...ый, пёстротка...ый, плавле...ый, плете...ый, потроше...ый, порче...ый, проше...ый, проще...ый, пуга...ый, ра...е...ый, рва...ый, реза...ый, рубле...ый, самотка...ый, слое...ый, соле...ые, стега...ый, стира...ый, стреля...ый, стриже...ые, суше...ыми, тёса...ый, тис...е...ый, тка...ый, топле...ый, топле...ое, трёпа...ый, туше...ые, учё...ая, хвале...ый, холё...ый, чище...ый, штукатуре...ый, щипа...ый');
arrPrichNesov = prichNesov.split(',').map(x => x.trim());

const prichIskl = ('кова...ый, жёва...ый, кова...ая, жёва...ая, кова...ые, жёва...ые, цельнокова...ый, златокова...ый, среброкова...ый, чугуннокова...ый');
arrPrichIskl = prichIskl.split(',').map(x => x.trim());

const prichKr = ('беле...ый, беше...ый, варе...ый, вяле...ый, грабле...ый, гра...е...ый, груже...ый, дёрга...ый, долбле...ый, домотка...ый, жаре...ый, золоче...ый, игра...ый, изумле...ая, кале...ый, калече...ый, кваше...ая, кипяче...ая, клейме...ый, клёпа...ый, колоче...ый, комка...ый, копа...ый, копче...ый, кормле...ый, краде...ое, крахмале...ый, краше...ыми, крепле...ый, креще...ый, кроше...ый, круче...ый, лече...ый, лома...ый, лоще...ый, меря...ый, мече...ый, меша...ый, молоче...ый, море...ый, мороже...ое, моче...ый, моще...ая, ...ебеле...ый, ...евяле...ый, ...егаше...ые, ...екоше...ый, ...екормле...ый, ...емаза...ое, ...есоле...ый, ...етка...ый, ...етопле...ый, ...ечеса...ый, ...ехоже...ый, ...ештопа...ый, ...оше...ый, пале...ый, паре...ый, паха...ый, пая...ый, перче...ый, пёстротка...ый, плавле...ый, плете...ый, потроше...ый, порче...ый, проше...ый, проще...ый, пуга...ый, ра...е...ый, рва...ый, реза...ый, рубле...ый, самотка...ый, слое...ый, соле...ые, стега...ый, стира...ый, стреля...ый, стриже...ые, суше...ыми, тёса...ый, тис...е...ый, тка...ый, топле...ый, топле...ое, трёпа...ый, туше...ые, учё...ая, хвале...ый, холё...ый, чище...ый, штукатуре...ый, щипа...ый');
arrPrichKr = prichKr.split(',').map(x => x.trim());

const prilVetr = ('ветре...ый, ветре...ая, ветре...ые, ветре...ыми, неветре...ый, неветре...ая, ветре...ой');
arrPrilVetr = prilVetr.split(',').map(x => x.trim());

const prilNul = ('бакла...ий, бара...ий, двуеди...ый, дельфи...ий, драко...ий, еди...ый, зеле...ый, каба...ий, оле...ий, пелика...ий, преси...ий, румя...ый, саза...ий, си...ий, тарака...ий, триеди...ый, тюле...ий, фаза...ий, ю...ый');
arrPrilNul = prilNul.split(',').map(x => x.trim());

const prilAn = ('кожа...ый, мша...ый, песча...ый, ржа...ое, серопесча...ый, супесча...ый, кожа...ая, мша...ая, песча...ая, ржа...ая, серопесча...ая, супесча...ая');
arrPrilAn = prilAn.split(',').map(x => x.trim());

const prilJan = ('багря...ый, берестя...ой, ветря...ой двигатель, ветря...ая мельница, ветря...ая оспа, водя...ой, волося...ой, ворся...ой, гли...я...ый, дровя...ой, дупля...ой, земля...ых, избя...ой, ко...опля...ый, костя...ой, кровя...ая, ледя...ой, льня...ое, масля...ый, масля...истый, медвя...ый, нефтя...ое, нитя...ой, овся...ый, платя...ой, полотня...ый, пря...ый, серебря...ый, слюдя...ой, соля...ая кислота, сурьмя...ый, толокня...ый, торфя...ой, травя...истый, травя...ой, шерстя...ой, хворостя...ой');
arrPrilJan = prilJan.split(',').map(x => x.trim());

const prilIn = ('блоши...ый, воробьи...ый, голуби...ый, гости...ый, грачи...ый, гуси...ый, журавли...ые, звери...ый, змеи...ый, козли...ая, комари...ый,  крыси...ый, кури...ый, лебеди...ая, лоси...ый, лошади...ая, льви...ый, мали...овое, Марьи...а, муравьи...ый, мыши...ая, орли...ый, оси...ый, осли...ый, павли...ий, сови...ый, соболи...ый, соколи...ая, соловьи...ый, перепели...ый, пчели...ый, Татья...и...а, тетереви...ый, тигри...ый, тополи...ый, ути...ый, ястреби...ый');
arrPrilIn = prilIn.split(',').map(x => x.trim());

// Таблица состояний сегментов
// имя сегмента (как имя класса в HTML файле) => ( список слов для данного сегмента, включён ли сегмент (истина/ложь) )
const segmentsInfo = {
	"pril-iskl": { "wordArray": arrPrilIskl, "enabled": true },
	"kratk-ot-prich": { "wordArray": arrKratkotPrich, "enabled": true },
	"suff-onn-enn": { "wordArray": arrSuffOnnEnn, "enabled": true },
	"sush-n": { "wordArray": arrSushN, "enabled": true },
	"prich-s-prist": { "wordArray": arrPrichsPrist, "enabled": true },
	"prich-sov": { "wordArray": arrPrichSov, "enabled": true },
	"prich-ovaeva": { "wordArray": arrPrichOvaEva, "enabled": true },
	"prich-zavis": { "wordArray": arrPrichZavis, "enabled": true },
	"prich-nesov": { "wordArray": arrPrichNesov, "enabled": true },
	"prich-iskl": { "wordArray": arrPrichIskl, "enabled": true },
	"prich-kratk": { "wordArray": arrPrichKr, "enabled": true },
	"pril-vetren": { "wordArray": arrPrilVetr, "enabled": true },
	"pril-nulsuf": { "wordArray": arrPrilNul, "enabled": true },
	"pril-an": { "wordArray": arrPrilAn, "enabled": true },
	"pril-jan": { "wordArray": arrPrilJan, "enabled": true },
	"pril-in": { "wordArray": arrPrilIn, "enabled": true },
};

// Границы колец, включая центральный кружок, в процентах от половины высоты/ширины квадрата с мишенью
const targetRadiuses = [
    0.136, // Центр
    0.235, // Первый сегмент
    0.327, // Второй сегмент
    0.422  // Третий сегмент
];

// Сегменты, против часовой стрелки начиная справа выше центра
const targetSegments = [
    // Правая верхняя доля
    [
        '', // внутренний сегмент ничего не значит
        'prich-zavis', // с зависимыми словами
        'prich-ovaeva', // с суффиксами ова-ева
        [
            'prich-sov', // соверш. вид
            'prich-s-prist' // с приставкой (кроме не)
        ]
    ],
    [
        '',
        'sush-n', // от сущ. с основой на ...Н
        [
            'suff-onn-enn', // с суффиксами ЕНН, ОНН
            'pril-iskl' // прилагательные исключения
        ],
        [
            'kratk-ot-prich', // краткие, образов, от причастий
            'pril-iskl' // прилагательные исключения
        ]
    ],
    [
        '',
        'prich-kratk', // краткое
        'prich-iskl', // причастия исключения
        'prich-nesov' // без приставок несоверш. вида
    ],
    [
        '',
        'pril-vetren', // исключение ветреный
        'pril-nulsuf', // нулевой суффикс
        [
            'pril-in', // с суфф. ИН
            'pril-jan', // с суфф. ЯН
            'pril-an', // с суфф. АН
        ]
    ]
];